[
    {
      "id": 58,
      "date": "2024-11-17T18:43:43",
      "date_gmt": "2024-11-17T18:43:43",
      "guid": {
        "rendered": "http://themes.pixelwars.org/theblogger/default/?p=58"
      },
      "modified": "2024-12-18T15:16:06",
      "modified_gmt": "2024-12-18T15:16:06",
      "slug": "work-from-home-issues",
      "status": "publish",
      "type": "post",
      "link": "https://nutsovertech.com/work-from-home-issues/",
      "title": {
        "rendered": "15 reasons why relying 100% on remote work can turn out to be disastrous"
      },
      "content": {
        "rendered": "\u003Ch2\u003EWork from home? Why it can prove to be disastrous\u003C/h2\u003E\n\u003Cp\u003E&#8216;If army men decide to work from home even one season, we are all screwed!&#8221;\u003C/p\u003E\n\u003Cp\u003ESo let&#8217;s start by saying that there are few professions which just doesn&#8217;t support this concept at all. So this article may be relevant to only those who can leverage the connected world for earning bread and butter.\u003C/p\u003E\n\u003Cp\u003EWhile my first statement itself might be turning off for a lot of people since remote work is the in-thing, I want to let everyone know that I work from home at least once a week and I do believe it works. For one I have been able to add some serious feathers to my cap working from home on pre-specified days and with a plan.\u003C/p\u003E\n\u003Cp\u003E&nbsp;\u003C/p\u003E\n\u003Ch3\u003ESo here goes my justification for why I think work from home might make sense:\u003C/h3\u003E\n\u003Col\u003E\n\u003Cli\u003EIt&#8217;s a complete 24 karat gold time. Not even a single working minute gets wasted and one can focus for as long as their attention span is.\u003C/li\u003E\n\u003Cli\u003EThere is no context switching due to distractions/change in priorities by other people. It&#8217;s proven, context switching only wastes a ton of your time and is a known productivity killer.\u003C/li\u003E\n\u003Cli\u003ENo travel overheads. People get to work at a time and place convenient to them without having to deal with things that aren&#8217;t in their control.\u003C/li\u003E\n\u003Cli\u003EOrganizations save operational overhead.\u003C/li\u003E\n\u003Cli\u003ECommunications and processes get much more regimented and precise.\u003C/li\u003E\n\u003Cli\u003ENo toxic meetings and no dealing with that one under-prepared and uninformed moron who derails the whole agenda and wastes everyone&#8217;s time.\u003C/li\u003E\n\u003Cli\u003EHuge talent pool! The whole world is at your exposure and some of the best minds who prefer isolation over group settings are yearning for employers like you.\u003C/li\u003E\n\u003C/ol\u003E\n\u003Cp\u003EThus I believe well defined and pre-planned work from home is great and in some ways highly useful for organizations as well as individuals.\u003C/p\u003E\n\u003Ch3\u003EHowever, a 100% reliance can prove to be fatal for both. Here is how:\u003C/h3\u003E\n\u003Cp\u003EI would go with career angle first: &#8211;\u003Cbr /\u003E\n1. You are lost without mentor: If you are just getting started, work from home is a definitively a no go. Since you need a mentor to save you from wandering and making sure you are putting your energy in the right direction.\u003C/p\u003E\n\u003Cp\u003E2. Growth is proportional to impact you create: Businesses value contribution by the size of responsibility you handle. Thus your growth comes coupled with the size of responsibility (read as revenues you directly / indirectly impact). While you may grow well initially as individual contributors. You will hit a ceiling early in your career since as an individual, irrespective of your expertise, there is only this much value you can bring to an organization. Also, the problem with choosing to be limited at one skill or department is it may get commoditized soon and you stand the risk of replaced by robots.\u003C/p\u003E\n\u003Cp\u003E3. No connection or sense of purpose: For the majority of folks, the only thing that motivates them while working from home is the salary they get, the flexibility they have and savings they do in commuting. These, however, do not make one feel the part of a larger community or purpose. You are reduced to your tickets that you are handed over to resolve. You may have no clue on where it is coming from or where its headed to.\u003C/p\u003E\n\u003Cp\u003E4. You are never a part of the decision-making process: No one wants to bypass you, Its just tough to invite you into decision making conversations when it&#8217;s a whole group whiteboarding.\u003C/p\u003E\n\u003Cp\u003E5. We are sum total of people who we have ever met: Some of the greatest travelers on earth traveled across the globe to meet new people and gain experiences. When working from home, where would you find these people from? Skype?\u003C/p\u003E\n\u003Cp\u003E6. Giving back is your responsibility too: Just imagine if every senior had chosen to work remotely when you joined in as fresher. Who would you have looked up to? Turn the tables around, in the same context you are obliged to give back what you have learned to next set of freshers and this is not a favor, but your duty.\u003C/p\u003E\n\u003Cp\u003E7. Dealing with distractions: Dealing with distractions at home or your place of comfort isn&#8217;t the same as it&#8217;s at work. There is always a risk of colleague walking across for a banter or coaxing you to join for tea. But at home, it&#8217;s worse. Right from attending all phone calls, to kids (if you have any), running errands, opening the door every time someone shows up, the list goes on. If one were to do cost value proposition, they would say your getting distracted at the office is much better &#8211; at least it helps you build better relations and camaraderie with peers, juniors, and seniors.\u003C/p\u003E\n\u003Cp\u003E8. You don&#8217;t know what you don&#8217;t know: Asking questions limited to work or your problems you are facing with delivery only gets you limited answers. You don&#8217;t get answers to better ways of solving the problem. You don&#8217;t get answers on what other methods exist. You are left to your own means. While that works great for a lot of people, it turns out to be a serious waste of time for few.\u003C/p\u003E\n\u003Cp\u003E9. Missing &#8211; &#8220;Over the shoulder&#8221; approach: This to me ranks as the biggest disadvantage. When you have a peer or a senior watching over the shoulder, they stop you going down the wrong lane early in your journey. There are few who would love to learn from their own mistakes. But to me, there is no fun in repeating the mistake which someone has already committed and can predict consequences in advance. It&#8217;s not only a waste of time for you but also ends up in wasting organization work cycle. Also, in theory, I can tell you step by step process to accomplish a task. In reality, when the result isn&#8217;t as per expectation, it&#8217;s not until I see what you have done, I can tell you where you have messed up or may mess up. The whole exercise from the sound of it feels like a huge waste of time, energy, and limited resources.\u003C/p\u003E\n\u003Cp\u003EAs an organization:\u003Cbr /\u003E\n10. Your better players pay the price for rest: Working remotely works well for people who have a clear understanding of delivery, business, dependencies, and accountability. Such people, however, are rare. Rest of the team, need more handholding on everything else except what they are experts on. This essentially ends up taxing the very few who get it. Not only they are coping with their responsibility to lead and get work done, they are now also dealing with getting hold of people for it. They find themselves repeating the same things in different teammates and in conference calls, there is always someone with background noise who kills it for the whole team.\u003C/p\u003E\n\u003Cp\u003E11. Its a collaboration nightmare: So when do you plan to have your stand-ups? What would you do about whiteboarding sessions? How do you do planning poker? All on conference calls and bridge line? While there are tools for everything, there is an additional coordination that needs to be done to get everyone together. To quote Marissa Meyer, “People are more collaborative, more inventive when people come together.&#8221; According to her, things like Flickr photo being shown in Yahoo weather app cant happen when people didn’t bump into each other. She said: “Those things don&#8217;t come together unless someone from Flickr runs into someone from Weather in the hallway or cafeteria and has that conversation,”\u003C/p\u003E\n\u003Cp\u003E12. A stream of pings and calls: You have TOO many channels deal with anyways &#8211; slack, skype, whats app, Basecamp, emails and phone calls. Having half of the team working from home makes sure that all them get used and little time is spent on delivery.\u003C/p\u003E\n\u003Cp\u003E13. Misuse of facilities: While there are several reasons to believe that everyone will be honest and responsible towards using this &#8220;facility&#8221; judiciously. We as humans have amazing rationalization skills. So we can completely rationalize why it was ok to make a trip to the departmental store during peak working hours and why it didn&#8217;t hurt the company at all!\u003C/p\u003E\n\u003Cp\u003E14. Organizational Experience: A client comes to any organization seeing its portfolio and its maturity to be the ability to deliver the assignment at hand based on your previous capability. While the organization as a whole might have a lot of experience in the domain or delivery, the individual connecting remotely still sees a ticket which got assigned to him by someone. The problem with that is, there barely any positive learning curve utilized. So irrespective of what your complete organization experience is, for the client more often than not, it&#8217;s a fresher in the domain working on their project.\u003C/p\u003E\n\u003Cp\u003E15. Its an entitlement only mature people deserve: In a conversation, one of my organization&#8217;s star performers complained that flexible work hours are leading to issues. People don&#8217;t come in for the daily scrums on time and when they do show up, they need to be told all over again what the priority is. Worse, the people dependant on the last guy showing up end up getting much lesser hours to do their job, leading to them postponing that tasks to next day since they have their own cutoffs. Also, identifying dependancy and planning the day in accordance with others is not what everyone is good at. While she wasn&#8217;t complaining about flexible work hours but the maturity folks availing it. I can&#8217;t imagine what it would be like to have the whole team on a flexible work from home with such kind of maturity.\u003C/p\u003E\n\u003Cp\u003ETo conclude, I do not want to put a disclaimer that these are just my thoughts and so on. I know I may be deeply criticized for it. But here is the reality &#8211; we all need truth tellers! Who makes you face the hard reality without letting you pussyfoot around the problems.\u003C/p\u003E\n",
        "protected": false
      },
      "excerpt": {
        "rendered": "\u003Cp\u003EWork from home? Why it can prove to be disastrous &#8216;If army men decide to work from home even one season, we are all screwed!&#8221; So let&#8217;s start by saying that there are few professions&#8230; \u003C/p\u003E\n\u003Cp class=\"more\"\u003E\u003Ca class=\"more-link\" href=\"https://nutsovertech.com/work-from-home-issues/\"\u003ERead More\u003C/a\u003E\u003C/p\u003E\n",
        "protected": false
      },
      "author": 3,
      "featured_media": 2508,
      "comment_status": "open",
      "ping_status": "open",
      "sticky": true,
      "template": "",
      "format": "standard",
      "meta": {
        "inline_featured_image": false,
        "footnotes": ""
      },
      "categories": [38],
      "tags": [],
      "class_list": [
        "post-58",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-career"
      ],
      "aioseo_notices": [],
      "_links": {
        "self": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts/58"
          }
        ],
        "collection": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts"
          }
        ],
        "about": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/types/post"
          }
        ],
        "author": [
          {
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/users/3"
          }
        ],
        "replies": [
          {
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/comments?post=58"
          }
        ],
        "version-history": [
          {
            "count": 3,
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts/58/revisions"
          }
        ],
        "predecessor-version": [
          {
            "id": 2465,
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts/58/revisions/2465"
          }
        ],
        "wp:featuredmedia": [
          {
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/media/2508"
          }
        ],
        "wp:attachment": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/media?parent=58"
          }
        ],
        "wp:term": [
          {
            "taxonomy": "category",
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/categories?post=58"
          },
          {
            "taxonomy": "post_tag",
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/tags?post=58"
          }
        ],
        "curies": [
          {
            "name": "wp",
            "href": "https://api.w.org/{rel}",
            "templated": true
          }
        ]
      }
    },
    {
      "id": 55,
      "date": "2024-10-03T18:41:06",
      "date_gmt": "2024-10-03T18:41:06",
      "guid": {
        "rendered": "http://themes.pixelwars.org/theblogger/default/?p=55"
      },
      "modified": "2024-12-18T15:15:41",
      "modified_gmt": "2024-12-18T15:15:41",
      "slug": "listen-to-your-customers",
      "status": "publish",
      "type": "post",
      "link": "https://nutsovertech.com/listen-to-your-customers/",
      "title": {
        "rendered": "Listen to your customers, but not before your soul."
      },
      "content": {
        "rendered": "\u003Cp\u003EWhy startups that go too far implementing all customer feedbacks end up signing up for failure\u003C/p\u003E\n\u003Cp\u003E“A customer is the most important visitor on our premises. He is not dependent on us. We are dependent on him. He is not an interruption in our work. He is the purpose of it. He is not an outsider in our business. He is part of it. We are not doing him a favor by serving him. He is doing us a favor by giving us an opportunity to do so.”\u003Cbr /\u003E\n\u003Cem\u003E– Mahatma Gandhi\u003C/em\u003E\u003C/p\u003E\n\u003Cp\u003E&nbsp;\u003C/p\u003E\n\u003Cp\u003EWhile I can’t emphasize more on this saying to my teams, I also believe in being pragmatic about it. The way consumer internet has evolved it has brought in new challenges with it &#8211; both for startups and consumers.\u003C/p\u003E\n\u003Cp\u003E&nbsp;\u003C/p\u003E\n\u003Ch3\u003ESide effects of Agility:\u003C/h3\u003E\n\u003Cp\u003EOne such challenge being agility! Thanks to some real DevOps rockstars out there who have made continuous integration and deployments easier than ever. The terminologies like “hotfixes” aren’t just limited to fixing issues in the live app, but also adding new features in virtually no time! This agility is leading to an expectation that maturity of a development team is depicted by how quickly it can react to market feedback. That’s true! But the side effect of this maturity is moving too fast in too many directions so incoherently that complete sense of purpose is lost and the startups just forget what they stand for!\u003C/p\u003E\n\u003Cp\u003EIf every sale requires you to add/ modify/suppress a feature then either you are selling wrong, or the initial problem definition is wrong! Don’t bake in these changes as a part of product evolution; else everything will go wrong!\u003C/p\u003E\n\u003Cblockquote\u003E\u003Cp\u003E&#8220;If you stand for nothing, then you&#8217;ll fall for everything.&#8221;\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cp\u003E&nbsp;\u003C/p\u003E\n\u003Ch3\u003E&#8220;Pivot&#8221; comes to rescue:\u003C/h3\u003E\n\u003Cp\u003EPivoting is the new normal and is an answer to every half backed marketing and adoption strategy.\u003C/p\u003E\n\u003Cblockquote\u003E\u003Cp\u003E&#8220;A consumer internet product, in a lot of ways is an answer to question the questions which the customer hasn&#8217;t asked yet.&#8221; \u003Cem\u003E&#8211; Saurav Mishra\u003C/em\u003E\u003C/p\u003E\n\u003Cp\u003E&nbsp;\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cp\u003ESo adoption requires first making your customers address the problem and then giving your product as a solution. This whole process may take time and may not be carried out well by sales or marketing people. Worse, a pivot is just a LOT of work for your product development team and ends up being a paid vacation for sales, marketing, and account management teams! Since now they have no product to sell and thus no customers to manage!\u003C/p\u003E\n\u003Ch3\u003EEvery addition is a complication for New Customer:\u003C/h3\u003E\n\u003Cp\u003EBasecamp.com, a new generation project management software is a living testimonial of this. A quote from the book Getting real (written by makers of Basecamp)\u003C/p\u003E\n\u003Cp style=\"text-align: center;\"\u003E\u003Cem\u003E“Make each feature work hard to be implemented. Make each feature prove itself and show that it&#8217;s a survivor. It&#8217;s like &#8220;Fight Club.&#8221; You should only consider features if they&#8217;re willing to stand on the porch for three days waiting to be let in.\u003C/em\u003E\u003C/p\u003E\n\u003Cp style=\"text-align: center;\"\u003E\u003Cem\u003EThat&#8217;s why you start with no. Every feature request that comes to us — or from us — meets a no. We listen but don&#8217;t act. The initial response is &#8220;not now.&#8221; If a request for a feature keeps coming back, that&#8217;s when we know it&#8217;s time to take a deeper look. Then, and only then, do we start considering the feature for real.”\u003C/em\u003E\u003Cbr /\u003E\n\u003Cem\u003E ― 37 Signals, Getting Real\u003C/em\u003E\u003C/p\u003E\n\u003Cp\u003EI not only endorse it to every customer and product team I talk to but also try to live by it every day! While the new feature may help solve one obscure edge case scenario for one customer, its an additional complexity to every new customer who gets onboard. Thus the chances of losing more customers during trial period increases!\u003C/p\u003E\n\u003Ch3\u003EMethod to the madness:\u003C/h3\u003E\n\u003Cp\u003EThere are smarter ways to deal with this of course.\u003Cbr /\u003E\n&#8211; Meet customers, explain them the product. Not just features but the philosophy. Whether its a utility or a strategy product. What to expect and what not to expect and how to get the best out of it.\u003Cbr /\u003E\n&#8211; Change messaging. Sharpen your pitch, make sure you are explaining your core proposition better and not relying on &#8220;oh we have a feature for that!&#8221;.\u003Cbr /\u003E\n&#8211; Educate your sales and account managers\u003Cbr /\u003E\n&#8211; Evolve a service wing for additional customizations. Charge additional for customization and only integrate features that are relevant to your core product in the long run. Use the power of versioning tools like Git &#8211; to create separate branches for new requirements and customizations.\u003Cbr /\u003E\n&#8211; Pivot re-explained:\u003Cbr /\u003E\n&#8220;A Pivot is a change in strategy without changing the vision&#8221; &#8211; Eric Ries\u003C/p\u003E\n\u003Cp\u003EBefore taking aggressive product and business decision a.k.a Pivoting, please consider evaluating your adoption and marketing efforts. Also, there is a difference between uncovering a new detail versus a new requirement that should lead to a change in the product roadmap altogether!\u003Cbr /\u003E\nIn case you have agreed to take a Pivot, first make sure you had your initial problem definition floored and defeated before you start on anything new. Now use the same logic for your post-pivot problem definition! See if it stands the test!\u003C/p\u003E\n\u003Ch3\u003EThe take away:\u003C/h3\u003E\n\u003Cp\u003EThe purpose of the post is to not encourage &#8220;My way or highway&#8221; approach. But make startups and entrepreneurs think of how to get to an intersection of what the client needs the most, what&#8217;s the core idea behind the startup and what can potentially give the startup a fair chance to be world class!\u003C/p\u003E\n",
        "protected": false
      },
      "excerpt": {
        "rendered": "\u003Cp\u003EWhy startups that go too far implementing all customer feedbacks end up signing up for failure “A customer is the most important visitor on our premises. He is not dependent on us. We are dependent&#8230; \u003C/p\u003E\n\u003Cp class=\"more\"\u003E\u003Ca class=\"more-link\" href=\"https://nutsovertech.com/listen-to-your-customers/\"\u003ERead More\u003C/a\u003E\u003C/p\u003E\n",
        "protected": false
      },
      "author": 3,
      "featured_media": 2468,
      "comment_status": "open",
      "ping_status": "open",
      "sticky": true,
      "template": "",
      "format": "standard",
      "meta": {
        "inline_featured_image": false,
        "footnotes": ""
      },
      "categories": [33],
      "tags": [],
      "class_list": [
        "post-55",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-product-management"
      ],
      "aioseo_notices": [],
      "_links": {
        "self": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts/55"
          }
        ],
        "collection": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts"
          }
        ],
        "about": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/types/post"
          }
        ],
        "author": [
          {
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/users/3"
          }
        ],
        "replies": [
          {
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/comments?post=55"
          }
        ],
        "version-history": [
          {
            "count": 7,
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts/55/revisions"
          }
        ],
        "predecessor-version": [
          {
            "id": 2472,
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts/55/revisions/2472"
          }
        ],
        "wp:featuredmedia": [
          {
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/media/2468"
          }
        ],
        "wp:attachment": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/media?parent=55"
          }
        ],
        "wp:term": [
          {
            "taxonomy": "category",
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/categories?post=55"
          },
          {
            "taxonomy": "post_tag",
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/tags?post=55"
          }
        ],
        "curies": [
          {
            "name": "wp",
            "href": "https://api.w.org/{rel}",
            "templated": true
          }
        ]
      }
    },
    {
      "id": 2270,
      "date": "2024-08-02T18:27:34",
      "date_gmt": "2024-08-02T18:27:34",
      "guid": {
        "rendered": "http://themes.pixelwars.org/theblogger/default/?p=34"
      },
      "modified": "2024-12-18T15:15:56",
      "modified_gmt": "2024-12-18T15:15:56",
      "slug": "a-case-for-b-players",
      "status": "publish",
      "type": "post",
      "link": "https://nutsovertech.com/a-case-for-b-players/",
      "title": {
        "rendered": "A case for B-Players"
      },
      "content": {
        "rendered": "\u003Ch3\u003EDefining the B-player\u003C/h3\u003E\n\u003Cp\u003EThe term B-player comes from the world of sports where terminologies like A-player, B player, B-team, are frequently used. Eventually, it made way in the recruitment world working in a realm of talent search day in and day out! A famous saying goes:\u003C/p\u003E\n\u003Cblockquote\u003E\u003Cp\u003E&#8220;A player hires A player, B player hires C player. &#8220;\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cp\u003ETo me, this is more real than any reality. I have issues where teams degraded in quality exponentially because of one B-player breaking the chain. The sheer cascading nature of this problem is catastrophic for any organization. Startups can get killed almost in no time if they let one B-player sneak into their team. For larger organizations, given the sheer size of it and tons of checks and balances, the effects are normalized.\u003C/p\u003E\n\u003Ch3\u003ESo who is this Bplayer?\u003C/h3\u003E\n\u003Cp\u003ESo a Bplayer isn&#8217;t low on IQ or presence of mind. They have a different temperament altogether. They just don&#8217;t see a similar fast-paced life for themselves as an A player would. In fact, they value work-life balance more than phenomenal career success. That is not to say they are incompetent; instead, they are competent and pretty steady at all times when it comes to working. They just don&#8217;t like to pull in attention; it&#8217;s not their thing. They mostly form a &#8220;stable core&#8221; part of any organization and like to dig tunnels without noise. They aren&#8217;t as charismatic as A players, and for sure they don&#8217;t know how to express what they are great at, even when they know it for themselves. B players tend to like more &#8220;stationary&#8221; careers, don&#8217;t require a lot of attention, and they get the job done. Because they stay, they love to carry the corporate history with them.\u003C/p\u003E\n\u003Cp\u003EWhile this may all sound like praise, whats scary is justification. If they can&#8217;t do something right for the first time, they just refrain away from it or justify it to themselves that it&#8217;s not their cup of tea. In a lot of cases, I believe they don&#8217;t ask tough questions to themselves, which we&#8217;ll talk about in the later in the book. Given the value they deliver to their teams and their organizations, just one right question can turn things around for them, for real.\u003C/p\u003E\n\u003Cp\u003EWhats also limiting is the choices a Bplayer makes. They just restrict themselves to the amount of exposure they can get. They would happily let an A-player take away the great opportunity, and they will be ok to play a supporting role.\u003C/p\u003E\n\u003Cp\u003EBut there are severe repercussions to it: the problem is NOT about being a Bplayer. The problem is the feeling of being under-valued, unappreciated, ignored and feeling so angry about these for so long that this becomes the reality of their life. So much so, they think that they are treated as commodities, and somewhere they start behaving like one. An interesting quote by Thomas J. Delong:\u003C/p\u003E\n\u003Cblockquote\u003E\u003Cp\u003EIF YOU IGNORE [B PLAYERS] LONG ENOUGH, THEY BEGIN TO SEE THEMSELVES AS LOW PERFORMERS.\u003Cbr /\u003E\n— THOMAS J. DELONG\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cp\u003EFrom here, it gets into a downward spiral loop. Since they have gone so far down the road of not believing in yourself and the fact that world doesn&#8217;t care about them.. they stop bringing anything new to the table. They start justifying their miseries of life and lack of appreciation of work as a problem with the world. They now just choose to play second fiddle, be their boss&#8217;s punch bag or a sidekick to that poster boy of the class.\u003C/p\u003E\n\u003Ch3\u003EIn the context of organizations:\u003C/h3\u003E\n\u003Cp\u003EHere is the reality, not my words, but I&#8217;ll quote Harvard business review on it.\u003C/p\u003E\n\u003Cp\u003E&#8220;Companies are routinely blinded to the important role B players serve in saving organizations from themselves. They counterbalance the ambitions of the company’s high-performing visionaries whose esteemed strengths when carried to an extreme, can lead to reckless or volatile behavior.&#8221;\u003C/p\u003E\n\u003Cp\u003EA note to the B-player&#8230;\u003Cbr /\u003E\nYou are important, showing the importance though doesn&#8217;t come naturally to you. While the show business is not what I am trying to convince you into, you need to make your efforts count when it&#8217;s really needed &#8211; not only for your own good sake but also for those who are in running the show in your organization and has a tiny time window to make judgments. You need to help them to help you. Else you fall off their radar. That, on record, benefits no one. While the leader loses a formidable B-Player, you lose trust and confidence in yourself.\u003C/p\u003E\n\u003Cp\u003EThis blog aims to do the following:\u003Cbr /\u003E\nHelp an average Bplayer get to an above average achievement without really compromising their preferences. Keep in touch and take care!\u003C/p\u003E\n",
        "protected": false
      },
      "excerpt": {
        "rendered": "\u003Cp\u003EDefining the B-player The term B-player comes from the world of sports where terminologies like A-player, B player, B-team, are frequently used. Eventually, it made way in the recruitment world working in a realm of&#8230; \u003C/p\u003E\n\u003Cp class=\"more\"\u003E\u003Ca class=\"more-link\" href=\"https://nutsovertech.com/a-case-for-b-players/\"\u003ERead More\u003C/a\u003E\u003C/p\u003E\n",
        "protected": false
      },
      "author": 3,
      "featured_media": 2506,
      "comment_status": "open",
      "ping_status": "open",
      "sticky": true,
      "template": "",
      "format": "standard",
      "meta": {
        "inline_featured_image": false,
        "footnotes": ""
      },
      "categories": [38, 37],
      "tags": [],
      "class_list": [
        "post-2270",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-career",
        "category-teams-careers"
      ],
      "aioseo_notices": [],
      "_links": {
        "self": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts/2270"
          }
        ],
        "collection": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts"
          }
        ],
        "about": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/types/post"
          }
        ],
        "author": [
          {
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/users/3"
          }
        ],
        "replies": [
          {
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/comments?post=2270"
          }
        ],
        "version-history": [
          {
            "count": 3,
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts/2270/revisions"
          }
        ],
        "predecessor-version": [
          {
            "id": 2507,
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts/2270/revisions/2507"
          }
        ],
        "wp:featuredmedia": [
          {
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/media/2506"
          }
        ],
        "wp:attachment": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/media?parent=2270"
          }
        ],
        "wp:term": [
          {
            "taxonomy": "category",
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/categories?post=2270"
          },
          {
            "taxonomy": "post_tag",
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/tags?post=2270"
          }
        ],
        "curies": [
          {
            "name": "wp",
            "href": "https://api.w.org/{rel}",
            "templated": true
          }
        ]
      }
    },
    {
      "id": 52,
      "date": "2024-02-12T18:39:32",
      "date_gmt": "2024-02-12T18:39:32",
      "guid": {
        "rendered": "http://themes.pixelwars.org/theblogger/default/?p=52"
      },
      "modified": "2024-12-18T15:09:50",
      "modified_gmt": "2024-12-18T15:09:50",
      "slug": "corporate-politics",
      "status": "publish",
      "type": "post",
      "link": "https://nutsovertech.com/corporate-politics/",
      "title": {
        "rendered": "Corporate politics vs the perception of it"
      },
      "content": {
        "rendered": "\u003Cp\u003EI get that a lot, every day &#8211; Stories of failure wrapped in linen of how the world is unfair and unjust for not granting what one deserves ( in their own minds at least ). Well, I ain’t gonna glorify failures beyond a point. Since they actually don’t get you results. But I do agree, I fail more than an average person does in their day to day life. But the reason why I bring it up was not discussing failures but the linen we use to wrap it in! One such linen is “Corporate Politics”. A lot of stories I hear are about how someone was subjected to corporate politics by teammates and managers ( read as demons) in their organization.\u003C/p\u003E\n\u003Cp\u003ESo frustrated I was for being given this an excuse to those several unwarranted failure stories, that I really set out to find what it really means.\u003C/p\u003E\n\u003Cp\u003EThe experiment was extremely tough since I had to get past my own judgments and first acknowledge that it’s more real for some people than what I imagine. It exists! Going out with a biased perspective wouldn’t have helped anyway. ( note how hard I am trying to keep this post unbiased )\u003C/p\u003E\n\u003Cp\u003EWhile I got several interpretations of what “corporate politics” mean. So here is what I gathered.\u003C/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EFavoritism\u003C/strong\u003E: Topping the list was Favouritism. This seemed to sound like the most common thread. Almost everyone who was subjected to the inhuman torture of “corporate politics” felt that their manager favored someone else over them.\u003C/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EVictimisations\u003C/strong\u003E: intentional targeting to demoralize someone to an extent where they start underperforming.\u003C/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EGroup-ism\u003C/strong\u003E: Ok, for me this was toughest to acknowledge, but did sound real when I heard through the whole case. A scenario where you feel you have a set of people ( may or may not include your manager ) who wants to see you are screwed. It’s the sole purpose of their life &#8211; to get most out of you without giving credits to You to may be Just sidelining you from all critical conversations and decision making.\u003C/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EShadowing:\u003C/strong\u003E I am not sure if that’s even the right term for it, but let me try to explain it. When someone takes away all the credit of what you have done for his career advancement at your cost. Also, this same person loves to delegate tasks to you including his own.\u003C/p\u003E\n\u003Cp\u003EAll these definitely sounded like real, but there was one more which I felt like was the undercurrent of all conversations: “ Complains”! Almost everyone felt aggrieved and passionately complained about others. But the problem is :\u003C/p\u003E\n\u003Cblockquote\u003E\u003Cp\u003EOne Of The Few Things I Complain About: Complaining &#8211; Gary Vaynerchuk\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cp\u003EExactly what I feel when I hear the phrase corporate politics. Let’s try to address each one of the problems here, with logical resolutions.\u003C/p\u003E\n\u003Ch3\u003EFavoritism\u003C/h3\u003E\n\u003Cp\u003EYeah I totally agree this is real. Even I have my favorites and I am sure even your manager would have it. But here is the truth &#8211; *even you have your favorites*.\u003C/p\u003E\n\u003Cp\u003EIt’s just human to get comfortable with people who we have spent more time with than just about every person one meets at work. Where lack of maturity begins is when a manager allows that comfort seep into work and gives undue advantage to his favorites. While that’s a serious underperformance on manager’s behalf, that does not translate into politics still. There is no one who can stop us from getting noticed for the amazing work we do. The traditional linear reporting structure is long gone and in collaborative environments, people even on the other side of the globe can tell whether someone rocks or sucks. You aren’t at the mercy of your manager, but for sure you are at the mercy of your willingness to prove a point.\u003C/p\u003E\n\u003Cp\u003EAlso, you got to be visible. Yes, I agree not everyone is into showman business or that may not be their style, but that doesn’t mean you can keep digging tunnels without letting the world know how far you have reached and hope someday someone will take a notice. Even You don’t bother to go to 2nd page of Google search result if the links aren’t “visible” in first five results. That’s how important visibility is to you. Your manager his own stuff to deal with, several other reports to manage and the someone to report to. Just imagine how much time does he have to take notice of You? In that small time window, I would be surprised if he actually does take notice and even if he does, it&#8217;s not to your credit. It&#8217;s his or hers!\u003C/p\u003E\n\u003Cp\u003ESo what does visibility entail:\u003C/p\u003E\n\u003Cp\u003ERemember:\u003C/p\u003E\n\u003Cblockquote\u003E\u003Cp\u003E&#8220;Your success makes your manager or client look good!&#8221; So there is definitely a vested interest on both sides! Now you got to leverage it!\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cp\u003EIn our day to day life and work, visibility can just be achieved by better communication! That&#8217;s it. Here is what you can do, by the way of regular habit:\u003C/p\u003E\n\u003Cp\u003E&#8211; Keep communicating about what you are working on.\u003Cbr /\u003E\nUse every opportunity of conversation to make it a meaningful interaction. How ridiculous can an answer get when someone asks &#8220;Hey, whats up!&#8221; or &#8220;whats going on&#8221;? Well, it can be as ridiculous as &#8220;Nothing much!&#8221;. I can&#8217;t fathom shallowness of this answer. It&#8217;s either simply suggests that either you are actually not doing anything (and thus deserve the politics you are being subjected to) or you just don&#8217;t want to talk.\u003Cbr /\u003E\nGo ahead and give them a quick insight into the greatness you are up to today. How you are so proud or excited about what you doing and/or how its gonna make a difference to your career or to the company! You won&#8217;t only feel great about yourself, but also enthuse energy into the listener. There is NO WAY he cannot take notice of it.\u003C/p\u003E\n\u003Cp\u003E&#8211; Ask questions that show you care and want to grow: Reaching out to the manager for regular feedback on just about everything related to you and work and at times even his work, whenever you get a chance. Sharing your aspirations and what new you are upto. What course you just bought or how you made your weekend productive. There is no way he can get insights into all of this till you tell him! But once he has it, no matter whether you are a favorite or no, he&#8217;ll pave way for you to ultimate career growth.\u003C/p\u003E\n\u003Cp\u003E&#8211; offer help whenever possible: Everyone needs help. But very few ask &#8220;Can I help you&#8221; not till they are getting paid for it. You don&#8217;t have to do that! You just need enough warmth to ask. More often than not you&#8217;ll be turned down. But every time that happens you would have crawled closer to that person&#8217;s heart!\u003C/p\u003E\n\u003Cp\u003Eand the last one:\u003C/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EJust ROCK!\u003C/strong\u003E\u003Cbr /\u003E\nYeah! get up every morning to rock! Hit your work every day to do better than what you did yesterday. Make sure you find the most elegant way of what you are supposed to accomplish. Focus on stuff that matters to you and your organization. Stretch that extra mile and go over and above your conventional job description!\u003C/p\u003E\n\u003Cp\u003EDon&#8217;t ever report to work again if it&#8217;s not fun or deep down you already know you suck at. Do something that makes you feel great and proud of. Adds meaning to your life and impacts your personal and professional goals positively. Yes, money is important, your salary cheques are thus essential. But it&#8217;s not worth sacrificing what you are great at or what you could be great at.\u003C/p\u003E\n\u003Ch3\u003EVictimization\u003C/h3\u003E\n\u003Cblockquote\u003E\u003Cp\u003EThe forces that are for you are greater than forces against you. God will take your scars and turn them into stars &#8211; Joel Osteen\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cp\u003E&#8220;Human being&#8221; is a violent species. We have evolved through ages to become civilized and not fight wars to win what doesn&#8217;t belong to us. However, deep within for few people, there is still believe that they can (and should) achieve success at the cost of others. While the theory of abundance by Peter Diamandis assures that there is enough for everyone, there is no doubt to the fact that there are still a lot who misinterpret Darwin&#8217;s &#8211; &#8220;survival of fittest&#8221; theory.\u003C/p\u003E\n\u003Cp\u003EIf you are on the receiving end or at least feel so, I feel sorry for you. But if you feel helpless about it, I believe you deserve it! No one can victimize you till you let them do that. While fighting back may not be an option always, feeling helpless, definitely isn&#8217;t the solution. I have personally been on receiving end quite a few numbers of times, in some cases, I fought back, and in some, I tried to steer clear while minimizing damage. That&#8217;s what you can do too! When being brave does not have enough incentives over being smart, in such cases, steering clear is the best solution. But if that&#8217;s not an option, then don&#8217;t let the fear of repercussion let you give up and just suffer. Ask for help, connect with people who you have dealt with similar situations in past, there has to be a way out.\u003C/p\u003E\n\u003Cp\u003EAll this assuming your hypothesis of victimization is right. There are other cases where we are reaping what we have sown! Nothing lesser than a true conscientious reflection can show that. While we naturally bend towards justification, seeing it from someone else&#8217;s perspective will definitely help.\u003C/p\u003E\n\u003Cp\u003EThe third and most common possibility (that&#8217;s why I saved it for last) \u003Cstrong\u003Eis you are simply overthinking\u003C/strong\u003E. All the stories of violence and reflections aside, get this clear for yourself: There are very little chances that your fall can help someone rise. While that&#8217;s pretty much possible for high profile positions and that&#8217;s what all the television soaps show. Its highly unlikely that it applies to you. Here is a simple method to judge this &#8211; ask yourself a question and try to answer keeping in mind the person who you think is after your life (or job or wants to see you destroyed):\u003Cbr /\u003E\n1. What would he get if he is successful?\u003Cbr /\u003E\nOnce you have answered this, then answer this:\u003Cbr /\u003E\n2. Why can&#8217;t they get that anyway? Aren&#8217;t there &#8220;less evil&#8221; way for them to get it?\u003Cbr /\u003E\nWhile answering this you may be able to discover that either you are subconsciously coming in their way or you are overestimating your position, since they can get what they want anyway!\u003Cbr /\u003E\nIf you haven&#8217;t arrived at a conclusion yet then try asking this:\u003Cbr /\u003E\n3. What if I give it to them myself or consciously help them with it?\u003Cbr /\u003E\nOk, this one is eerie if it means you losing something important to you. You don&#8217;t have to actually give it away if you don&#8217;t want to. But you can definitely think of middle ground. This actually needs you to initiate a conversation with them &#8211; which you may or not be comfortable with. But if you actually decide to talk, I can tell you that there is a good probability that your hypothesis of victimization will fall flat on the face.\u003C/p\u003E\n\u003Cp\u003EIf none of the above is true, then congratulate your self (note: I am being sadistic) you have found a terrorist. The types who would are just sadist enough to get pleasure from your pain or get proven right by your failures. If such is your case, then what you are dealing with is a complete distraction. You need to develop a rhino-thick skin and try to not feed their ego. Just steer clear as soon as possible and move on with your life. Everyone has a life to deal with. Hopefully, they will have it soon too! Pray for their success, at least that would distract their attention off you.\u003C/p\u003E\n\u003Cp\u003EIn a work set up, its best advised you do skip level meetings or talk to people who you think can help. Take control of the situation actively, your actions can be passive as you find your way out of the mess.\u003C/p\u003E\n\u003Cp\u003EA word of advice, irrespective of how real the problem is &#8211; while you go through all of this make sure you don&#8217;t let this hamper your work, your performance, and your key responsibility areas. The point is, with time this will subside but would stay is losses you have incurred.\u003C/p\u003E\n\u003Ch3\u003EGroupism:\u003C/h3\u003E\n\u003Cp\u003EThis is to say that you have managed to find a set of people in your organization or workplace who bar you from your fundamental rights at work like a conducive environment, being given critical tasks or at worst, your right to grow!\u003C/p\u003E\n\u003Cp\u003ELike we did before, let&#8217;s start with self-retrospection. What did you really do to turn so many people off! Everything I read about influencer marketing or being on social media is about how to make fans. Congrats you managed to make a group of haters! I am not really being mean to you, but I want you to think in ways you haven&#8217;t before. What part of your behavior, belief, approach or personality is attracting this? Be fair about your judgment and if you can&#8217;t make an unbiased one yourself, talk to someone who you know is not going to have any mercy on you while sharing their opinions. Your spouse &#8211; may be? Once detected, it&#8217;s your time to fix your own shortcomings, but before you do, even if you acknowledge it before one of those group members &#8211; you are all set!\u003C/p\u003E\n\u003Cp\u003ESuppose, you come out clean! Bright and shiny out of the acid test and there are real villains on another side. Here is what you got to do &#8211; try to see what gets them together. It can be a reason or just an influencer.\u003C/p\u003E\n\u003Cp\u003EIf the reason is actually affecting your or creating hurdles in your day to day operations, then you need to take it head-on.\u003Cbr /\u003E\nSeek the advice of senior folks or your company HR and sensitize them on the issue. They will either make arrangements for moving you out into a different project or department or actually show a different reason that you may not have comprehended. Irrespective, DO NOT step out of the room till you are convinced or decisively addressed the problem. Your persistence will define how seriously you are being taken. Follow up on action items you have discussed to agreed on. The idea is NOT to complain about people but to make your life easier. So make it clear that you DO NOT want any action to be taken against anyone. But you definitely need peace of mind.\u003C/p\u003E\n\u003Cp\u003EOn the other hand, if it&#8217;s an influencer who keeps the group together &#8211; Then consider reaching out to them directly, telling him / her your issues with &#8220;some&#8221; people and simply asking for advice on how to deal with it. Make sure, you exclude the person and you do not name anyone. Also, note it to them that you are considering some extreme actions and thus you need to know what he/she thinks. While this may come across a cheesy way to solve a problem, you are actually doing two things:\u003Cbr /\u003E\n&#8211; Waking the superhero that lives inside every human since you genuinely asked for help.\u003Cbr /\u003E\n&#8211; Making the source know that you now acknowledge their atrocities and that you are contemplating taking action without actually threatening them.\u003C/p\u003E\n\u003Ch3\u003EShadowing:\u003C/h3\u003E\n\u003Cp\u003ESome of the largest disasters in the history of humanity were accrued due to someone getting overly ambitious. There are and there will always be conflicts between those who want to move fast versus those who like much steadier pace. The approach here is same either up the ante or apply one of the approaches discussed above. If you were to take my advice, go with the former! It&#8217;s your ball, you got to run with it. I can&#8217;t stop saying this, you got to rock! Everything else will fall into place.\u003C/p\u003E\n\u003Cp\u003EStill don&#8217;t see a way out?\u003Cbr /\u003E\nIf you have read this far and still are getting a feeling that it&#8217;s not helping or that you have tried everything but it has not worked for you, then I feel sorry about your situation. There are no silver bullets to solve any of people-people problem since there is no single version of truth or right/wrong here. The pattern behind all my approaches is simple &#8220;Take control&#8221;. Blaming the world, complaining or submitting to it will only push you further to the edge.\u003C/p\u003E\n\u003Cblockquote\u003E\u003Cp\u003E&#8220;There is no ground for those who keep running away&#8221;\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cp\u003EYou need to stand for something or a take a stand when you know you are right. Giving up to bullies is actually supporting them. On the other hand, don&#8217;t overthink yourself into a mess. You may just be making all this up in your head. You got to deal with your own demons first.\u003C/p\u003E\n\u003Ch3\u003EAre you the one politicising?\u003C/h3\u003E\n\u003Cblockquote\u003E\u003Cp\u003E&#8220;There is a serious problem with the word &#8220;People&#8221;. It considers everyone but me&#8221;\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cp\u003ESo every time I say the word &#8220;people&#8221; and mention the problems they have, I actually exclude myself and to be nice to the person I am talking to, I exclude him too. I am sure that&#8217;s the problem with a lot of us. So when one says, &#8220;oh there is a lot of workplace politics here&#8221;, they conveniently exclude themselves out of it. I think being honest and self-aware helps here! Not just you but the whole organization.\u003C/p\u003E\n\u003Cp\u003EWatch your actions out. Watch what you say or how you behave with someone. You may get called into a group by your manager or other teammates for making judgments on someone performance. While the intent of the exercise may be legitimate, for the person being judged this may qualify as group-ism.\u003C/p\u003E\n\u003Cp\u003EYour project is in deep trouble and you need someone to intervene to save the day for you. You pull your phone out and call the guy on your quick-dial favorites list, not the one who is actually working on the project. There you go! Under stress, a person who was bypassed here will feel their interests compromised and you have subconsciously committed a hideous act of &#8220;corporate politics&#8221;. While you may feel stupefied by this allegation, that&#8217;s exactly how I feel when someone ever talks about corporate politics. It&#8217;s more subconscious for a lot of people and of course, none of us likes to be villains.\u003C/p\u003E\n\u003Cp\u003ESo in general, you may want to consciously think and not take for granted the interests of your colleagues. Please be aware, people are touchy by nature! There is no point justifying yourself here.\u003C/p\u003E\n\u003Cp\u003EKeeping away from negative influence and not fueling it Let me stop being nice for a minute. Do you gossip? Even if you don&#8217;t, it has a natural tendency to find you. Happens more with some people than others, given what their reputation is for entertaining gossips. Whats yours? I can see you nodding your head in disagreement. But here &#8211; let me redefine what gossip actually is. The dictionary definition of it is: &#8220;casual or unconstrained conversation or reports about other people, typically involving details which are not confirmed as true&#8221;.\u003C/p\u003E\n\u003Cp\u003EThere isn&#8217;t any problem with first half of definition &#8211; in fact, I believe its important for citizens of a free country! Its the later half that bothers me &#8211; &#8220;involving details which are not confirmed as true&#8221;. This is where gossips can get damaging. For you, it might mean a casual conversation, but for someone, it might mean the whole world! The best way to deal with these conversations is to carry an aura where people automatically refrain from bringing such conversations to you. The next best thing to do is not conform to any allegation, judgment or a complaint. Just in case you get exposed to such gossips without intent, you always know who is the right person to go and confirm facts with &#8211; its the person who is being talked about. Also, do me a favor, beat s**t out of the person who just got this hot news to you. Imagine, your one act can free the world from one of its largest workplace distraction &#8211; gossip! (Note: Please get the context. I am not promoting violence. I just want you to curb gossip resorting to as non-violent means as possible.)\u003C/p\u003E\n\u003Cp\u003EBeing subtle:\u003C/p\u003E\n\u003Cp\u003EThere is never &#8220;THE&#8221; perspective about anything. It&#8217;s always &#8220;A&#8221; perspective\u003Cbr /\u003E\nNothing in the world can be looked at from one perspective and judged solely based on that. When we know this, we learn to appreciate more perspectives. Suddenly everything we are confident about blends into reality and we get a maturity of acknowledging that my confidence can be unfounded. Just knowing this one fact, lends an immense amount of intellect and maturity to deal with situations where we are accusing someone of their underperformance or something which don&#8217;t think was right. In group or workplace settings, it helps us in knowing how much honesty and confidence is affordable and even if we have to pass on hard messages in a tough conversation, how to do it. What we don&#8217;t realize is it&#8217;s our tone, not content which creates trouble. Makes them feel victimized or targetted defeats the purpose of the conversation altogether.\u003C/p\u003E\n\u003Cp\u003E\u003Cimg fetchpriority=\"high\" decoding=\"async\" class=\"wp-image-2496 aligncenter\" src=\"https://nutsovertech.com/wp-content/uploads/2016/09/QuoteOnAdvice-300x150.jpg\" alt=\"\" width=\"454\" height=\"227\" srcset=\"https://nutsovertech.com/wp-content/uploads/2016/09/QuoteOnAdvice-300x150.jpg 300w, https://nutsovertech.com/wp-content/uploads/2016/09/QuoteOnAdvice-768x384.jpg 768w, https://nutsovertech.com/wp-content/uploads/2016/09/QuoteOnAdvice.jpg 1024w, https://nutsovertech.com/wp-content/uploads/2016/09/QuoteOnAdvice-550x275.jpg 550w, https://nutsovertech.com/wp-content/uploads/2016/09/QuoteOnAdvice-1000x500.jpg 1000w\" sizes=\"(max-width: 454px) 100vw, 454px\" /\u003E\u003C/p\u003E\n\u003Cp\u003EDo not start advising people until you are asked by them for it. Giving someone a piece of mind without knowing the complete context, generally gets greeted with resentment and frustration. Some of them are shown upfront and some are kept for later gossip! This is more relevant for millennials. While we love giving advise (since we are entitled to an opinion), we hate receiving them.\u003C/p\u003E\n\u003Ch3\u003ERedefining Workplace / Office / Corporate politics as Stakeholder analysis and management\u003C/h3\u003E\n\u003Cp\u003EWhen does Workplace / Office / Corporate politics become inevitable in a positive sense:\u003Cbr /\u003E\n&#8211; Some people care passionately about what they want to achieve. They will have their way. You may either be one of them or on receiving end of it.\u003Cbr /\u003E\n&#8211; Irrespective how big or small organization is, there is no way to get an agreement from everyone on board. When waiting isn&#8217;t an option, then executing at the cost of goodwill is necessary. Thus may go right or wrong, but not acting at all is always wrong!\u003Cbr /\u003E\n&#8211; You need to lobby to get a majority for what you believe in passionately. While that may look political, at the heart of it you know, there is no way people will support you till you walk them through &#8220;what is it in for me&#8221; questions.\u003Cbr /\u003E\n&#8211; You&#8217;ll always find sloths! They are everywhere and are generally the weakest links. As the saying goes, you are as strong as your weakest link. So while the HR and management take action, you need to keep the show running. Your decisions though can be easily considered as victimization stunts.\u003Cbr /\u003E\n&#8211; There goes a saying:\u003Cbr /\u003E\n&#8220;The best way to demotivate and lose top performers is to reward mediocrity in an attempt to maintain status quo.&#8221;\u003Cbr /\u003E\nSo you got to take special care of those who are moving the mountain for you. You may be accused of favoritism, so what?!\u003C/p\u003E\n\u003Cp\u003ESo, why would you conventionally attach a negative connotation to politics? That runs our country &#8211; right? However since we have already put Workplace/Office/corporate politics in a negative light, let me add in my perspective: To me, its just stakeholder analysis and management.\u003C/p\u003E\n\u003Cp\u003EBuilding relations and managing ego:\u003Cbr /\u003E\nWe were born with few relations &#8211; our mom, dad, brother, and sister. Nothing we did to earn any of them. Everything else we build beyond it is our interpersonal skills. However, a critical part of this is ego management. Anyone who has ever been part of any group would agree with this. In fact, I believe Entrepreneurs end up spending majority of their time in ego management (client, vendors, teams, investors and so on!). Now we don&#8217;t need to please everyone- since we can&#8217;t! But we need to know who matters and who don&#8217;t. That&#8217;s stakeholder analysis. No one is an exception here &#8211; until you have chosen to be an individual contributor and put a permanent jammer on your career. So you got to entertain people who matter to your work or life irrespective of your liking for them. No amount of self-justification will help here!\u003C/p\u003E\n\u003Cp\u003EPeople reflect your actions:\u003Cbr /\u003E\nThe moment you acknowledge their needs, you&#8217;ll see they&#8217;ll start recognizing your needs. That&#8217;s where symbiotic relations gets cultivated. On the contrary, if you bypass them, hurt their ego, ignore them, step on their toes, make them feel less important, challenge without caring for their feelings, you get exactly that in return. Worse &#8211; then you don&#8217;t get to control how they decide to give it back to you.\u003C/p\u003E\n\u003Cp\u003EGreat stakeholder analysis:\u003Cbr /\u003E\nA thoughtful stakeholder analysis will help you get things done! Period.\u003C/p\u003E\n\u003Cp\u003EHere is what you need to do:\u003Cbr /\u003E\n&#8211; Stakeholder analysis basics: Understanding how your work impacts your organization and clients. Whose (apart from you) neck is on the line if you mess up, whose job depends on you, whose responsibility are you and who are you responsible for. Who is getting paid for what you do and who is the one paying for it? Who is going to use your deliveries and how? There are more. It&#8217;s indeed another chapter altogether. But you are getting the drift right. Knowing your stakeholders and what matters to them is always the first step of any assignment you pick up. Bonus: it also saves you LOT of rework and headaches.\u003C/p\u003E\n\u003Cp\u003E&#8211; Appreciate people dynamics. There are formal and informal groups. That&#8217;s a social behavior of humans and animals both. Get to know them. There are preferences that people have like you do, and just like you, they need it to be respected.\u003C/p\u003E\n\u003Cp\u003E&#8211; Understand your team and organization hierarchy map. You may or may not be in the flat hierarchy organization. There are always some people who are credible, influential and are deeply respected, while there are few who are known to be ambitious about having their way.\u003Cbr /\u003E\n&#8211; Mind your behavior: Like I marked before be careful about giving advice and the tone you use. While your content may be relevant, people get tone first. Avoid whining and complaining. Stop making casual remarks.\u003Cbr /\u003E\n&#8211; Build relationships: That&#8217;s your equity and road to getting things done. Stretch an extra mile for someone without expecting returns. When you genuinely help, people acknowledge.\u003Cbr /\u003E\n&#8211; Increase visibility: As discussed before in the article. Do not let go a single opportunity of informing people what you are up to and how is that impacting your career and organization.\u003C/p\u003E\n\u003Cp\u003EI repeat&#8230;\u003C/p\u003E\n\u003Cblockquote\u003E\u003Cp\u003EJust go out there to ROCK!\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cp\u003Eand you may not have to worry about learning anything from this epic article!\u003C/p\u003E\n",
        "protected": false
      },
      "excerpt": {
        "rendered": "\u003Cp\u003EI get that a lot, every day &#8211; Stories of failure wrapped in linen of how the world is unfair and unjust for not granting what one deserves ( in their own minds at least&#8230; \u003C/p\u003E\n\u003Cp class=\"more\"\u003E\u003Ca class=\"more-link\" href=\"https://nutsovertech.com/corporate-politics/\"\u003ERead More\u003C/a\u003E\u003C/p\u003E\n",
        "protected": false
      },
      "author": 3,
      "featured_media": 2494,
      "comment_status": "open",
      "ping_status": "open",
      "sticky": true,
      "template": "",
      "format": "standard",
      "meta": {
        "inline_featured_image": false,
        "footnotes": ""
      },
      "categories": [37],
      "tags": [],
      "class_list": [
        "post-52",
        "post",
        "type-post",
        "status-publish",
        "format-standard",
        "has-post-thumbnail",
        "hentry",
        "category-teams-careers"
      ],
      "aioseo_notices": [],
      "_links": {
        "self": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts/52"
          }
        ],
        "collection": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts"
          }
        ],
        "about": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/types/post"
          }
        ],
        "author": [
          {
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/users/3"
          }
        ],
        "replies": [
          {
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/comments?post=52"
          }
        ],
        "version-history": [
          {
            "count": 4,
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts/52/revisions"
          }
        ],
        "predecessor-version": [
          {
            "id": 2570,
            "href": "https://nutsovertech.com/wp-json/wp/v2/posts/52/revisions/2570"
          }
        ],
        "wp:featuredmedia": [
          {
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/media/2494"
          }
        ],
        "wp:attachment": [
          {
            "href": "https://nutsovertech.com/wp-json/wp/v2/media?parent=52"
          }
        ],
        "wp:term": [
          {
            "taxonomy": "category",
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/categories?post=52"
          },
          {
            "taxonomy": "post_tag",
            "embeddable": true,
            "href": "https://nutsovertech.com/wp-json/wp/v2/tags?post=52"
          }
        ],
        "curies": [
          {
            "name": "wp",
            "href": "https://api.w.org/{rel}",
            "templated": true
          }
        ]
      }
    }
  ]